### UGADAIKA SLOV ###

from random import *

word_list = ['гармонь', 'игра', 'баллерина', 'вилка', 'шар', 'телефон', 'стол', 'ель', 'тряпка', 'фото', 'пазл', 'мракобесие', 'крем']

def get_word(): # функция выбора слова
    word = choice(word_list)
    word = word.upper()
    return(word)

def display_hangman(tries):
    stages = [ '''
             The END
            --------
            |       |
            |       0
            |     \ | /
            |       |
            |      //
            - 
               ''',
               '''
                   голова, тело, руки, одна нога
                   --------
                   |      |
                   |      0
                   |     \|/
                   |      |
                   |     /
                   -
               ''',
               ''' голова, тело, руки
                                  --------
                                  |      |
                                  |      0
                                  |     \|/
                                  |      |
                                  |     
                                  -
               ''',
               '''
               голова, тело, рука
                   --------
                   |      |
                   |      0
                   |     \|
                   |      |
                   |     
                   -
               ''',
               '''
               голова и тело
                   --------
                   |      |
                   |      0
                   |      |
                   |      |
                   |     
                   -
               ''',
               '''
               голова
                   --------
                   |      |
                   |      0
                   |      
                   |      
                   |     
                   -
               ''',
               '''
               начальное состояние
                   --------
                   |      |
                   |      
                   |     
                   |      
                   |     
                   -
               ''']
    return stages[tries]

#def play():   # функция процесса игры
print(get_word())
tries = 6
print('Давайте играть в угадайку слов!')
print(display_hangman(tries))

